Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/Users/karu/.atlantis/bin/terraform1.9.6 plan -input=false -refresh -out \"/Users/karu/.atlantis/repos/karuu/atlantis-test/3/default/default.tfplan\"" in "/Users/karu/.atlantis/repos/karuu/atlantis-test/3/default": exit status 1
module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["nodes"].data.aws_partition.current: Reading...
module.lb_irsa_role.data.aws_region.current: Reading...
aws_vpc.vpc: Refreshing state... [id=vpc-05742a80a0b8cd2c6]
aws_route53_zone.main: Refreshing state... [id=Z08508331WWLDEA0ZZ7DH]
module.external_dns_irsa_role.data.aws_partition.current: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-cluster/cluster]
aws_iam_role.eks_node_role: Refreshing state... [id=AWSEKSNodeRole]
aws_iam_role.eks_cluster_role: Refreshing state... [id=AWSEKSClusterRole]
module.lb_irsa_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.external_dns_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["nodes"].data.aws_partition.current: Read complete after 0s [id=aws]
module.external_dns_irsa_role.data.aws_caller_identity.current: Reading...
module.ebs_csi_irsa_role.data.aws_region.current: Reading...
module.lb_irsa_role.data.aws_caller_identity.current: Reading...
module.ebs_csi_irsa_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ebs_csi_irsa_role.data.aws_partition.current: Reading...
module.ebs_csi_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.external_dns_irsa_role.data.aws_region.current: Reading...
module.external_dns_irsa_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.lb_irsa_role.data.aws_partition.current: Reading...
module.lb_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_availability_zones.available: Reading...
aws_route53_zone.dev: Refreshing state... [id=Z0765274909A3VYJH19V]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=654654211926]
module.cluster_autoscaler_irsa_role.data.aws_caller_identity.current: Reading...
module.external_dns_irsa_role.data.aws_caller_identity.current: Read complete after 0s [id=654654211926]
module.eks.module.eks_managed_node_group["nodes"].data.aws_caller_identity.current: Reading...
module.lb_irsa_role.data.aws_caller_identity.current: Read complete after 0s [id=654654211926]
aws_iam_role.secret_manager_operator_role: Refreshing state... [id=AWSSMOperatorRole]
module.cluster_autoscaler_irsa_role.data.aws_caller_identity.current: Read complete after 1s [id=654654211926]
module.eks.module.eks_managed_node_group["nodes"].data.aws_caller_identity.current: Read complete after 1s [id=654654211926]
module.ebs_csi_irsa_role.data.aws_caller_identity.current: Reading...
module.cluster_autoscaler_irsa_role.data.aws_partition.current: Reading...
module.cluster_autoscaler_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.cluster_autoscaler_irsa_role.data.aws_region.current: Reading...
module.cluster_autoscaler_irsa_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::654654211926:user/carolina.pena@taloslabs.io]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=eks-cluster-cluster-20240925131928843200000005]
module.ebs_csi_irsa_role.data.aws_caller_identity.current: Read complete after 0s [id=654654211926]
module.ebs_csi_irsa_role.data.aws_iam_policy_document.ebs_csi[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=654654211926]
module.ebs_csi_irsa_role.data.aws_iam_policy_document.ebs_csi[0]: Read complete after 0s [id=212299854]
module.ebs_csi_irsa_role.aws_iam_policy.ebs_csi[0]: Refreshing state... [id=arn:aws:iam::654654211926:policy/AmazonEKS_EBS_CSI_Policy-20240925131928832700000004]
module.lb_irsa_role.data.aws_iam_policy_document.load_balancer_controller[0]: Reading...
module.lb_irsa_role.data.aws_iam_policy_document.load_balancer_controller[0]: Read complete after 0s [id=2997734474]
module.lb_irsa_role.aws_iam_policy.load_balancer_controller[0]: Refreshing state... [id=arn:aws:iam::654654211926:policy/AmazonEKS_AWS_Load_Balancer_Controller-20240925131928822600000003]
aws_route53_record.dev-ns: Refreshing state... [id=Z08508331WWLDEA0ZZ7DH_dev.example3.com_NS]
aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=AWSEKSClusterRole-2024092513193072600000000d]
aws_iam_role_policy_attachment.eks_service_policy: Refreshing state... [id=AWSEKSClusterRole-2024092513193037460000000a]
aws_iam_role_policy_attachment.eks_cni_policy: Refreshing state... [id=AWSEKSNodeRole-2024092513193039130000000b]
aws_iam_role_policy_attachment.ec2_container_registry_read_only: Refreshing state... [id=AWSEKSNodeRole-20240925131930371000000009]
aws_iam_role_policy_attachment.eks_worker_node_policy: Refreshing state... [id=AWSEKSNodeRole-20240925131930360300000008]
module.eks.module.eks_managed_node_group["nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["nodes"].aws_iam_role.this[0]: Refreshing state... [id=nodes-eks-node-group-2024092513193055520000000c]
aws_iam_role_policy_attachment.secret_manager_access_policy: Refreshing state... [id=AWSSMOperatorRole-20240925131930348300000007]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-cluster-cluster-20240925131928843200000005-2024092513193075950000000f]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-cluster-cluster-20240925131928843200000005-2024092513193075650000000e]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=651798112]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=cfcac7e5-8755-4ad2-bfc7-7000ec05aaf4]
module.eks.module.eks_managed_node_group["nodes"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=nodes-eks-node-group-2024092513193055520000000c-20240925131931591200000012]
module.eks.module.eks_managed_node_group["nodes"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=nodes-eks-node-group-2024092513193055520000000c-20240925131931562100000010]
module.eks.module.eks_managed_node_group["nodes"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=nodes-eks-node-group-2024092513193055520000000c-20240925131931573800000011]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0711b5b95f34b4c19]
aws_route53_zone.private: Refreshing state... [id=Z06356032VAE51W7ZGCD5]
aws_subnet.private_subnets["private_subnet_2"]: Refreshing state... [id=subnet-0aadde783fc872afa]
aws_subnet.public_subnets["public_subnet_1"]: Refreshing state... [id=subnet-05a925d12c73516cc]
aws_subnet.private_subnets["private_subnet_1"]: Refreshing state... [id=subnet-0f89b8bb0f08fc877]
aws_security_group.eks_nodes_sg: Refreshing state... [id=sg-0cffdf60e464de3d6]
aws_subnet.public_subnets["public_subnet_2"]: Refreshing state... [id=subnet-0d0fa7133972a1072]
aws_security_group.ingress_ssh: Refreshing state... [id=sg-0511157670696e19a]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-01038543615e78a72]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-05032c62f2b77a6cb]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0334d65b05c1c97d4]
aws_eip.nat_gateway_eip: Refreshing state... [id=eipalloc-01b4240c02b9757d1]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-cluster]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::654654211926:policy/eks-cluster-cluster-ClusterEncryption20240925131954430500000018]
module.external_dns_irsa_role.data.aws_iam_policy_document.external_dns[0]: Reading...
module.external_dns_irsa_role.data.aws_iam_policy_document.external_dns[0]: Read complete after 0s [id=2183713613]
module.external_dns_irsa_role.aws_iam_policy.external_dns[0]: Refreshing state... [id=arn:aws:iam::654654211926:policy/AmazonEKS_External_DNS_Policy-2024092513203429870000001a]
aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=rds-subnet-group]
aws_route_table_association.public["public_subnet_1"]: Refreshing state... [id=rtbassoc-008c9aab614243602]
aws_route_table_association.public["public_subnet_2"]: Refreshing state... [id=rtbassoc-0b46081e1c57d1c56]
aws_security_group.rds_sg: Refreshing state... [id=sg-07bda80f28d8ca31c]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2783171330]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-444222804]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3355063387]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1837580990]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2764383528]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2128314015]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3179757976]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3595838484]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1671796660]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-209272871]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1536957943]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-cluster-cluster-20240925131928843200000005-20240925131955290600000019]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-034d64b0bef2a8fec]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=eks-cluster]
aws_route_table.private_route_table: Refreshing state... [id=rtb-0e9cc1871663389d4]
aws_route_table_association.private["private_subnet_2"]: Refreshing state... [id=rtbassoc-0863e1c48654dbe2d]
aws_route_table_association.private["private_subnet_1"]: Refreshing state... [id=rtbassoc-0af62ed07fdfcd16a]
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-04eb76a21bb50a0b2,Environment]
module.eks.aws_eks_access_entry.this["example"]: Refreshing state... [id=eks-cluster:arn:aws:iam::654654211926:role/AWSEKSClusterRole]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=eks-cluster:arn:aws:iam::654654211926:user/carolina.pena@taloslabs.io]
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-09-25T13:31:50Z]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.module.eks_managed_node_group["nodes"].aws_launch_template.this[0]: Refreshing state... [id=lt-06a9063d2825ef9aa]
module.eks.module.eks_managed_node_group["nodes"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=374542303830080247]
module.eks.module.eks_managed_node_group["nodes"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-cluster:nodes-20240925133151662600000022]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=eks-cluster#arn:aws:iam::654654211926:user/carolina.pena@taloslabs.io#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=99d41e43229a4cdaf4141f3e8310e6d95c31dab9]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::654654211926:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/6A6D8E5870730337D5FBFDAFDA531BD0]
module.cluster_autoscaler_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.lb_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.external_dns_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.ebs_csi_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.cluster_autoscaler_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2391847788]
module.ebs_csi_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1421733227]
module.lb_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=765756433]
module.external_dns_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3892513946]
module.external_dns_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=eks-cluster-external-dns]
module.lb_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=eks-cluster-lb]
module.ebs_csi_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=eks-cluster-ebs-csi]
module.cluster_autoscaler_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=cluster-autoscaler]
module.cluster_autoscaler_irsa_role.data.aws_iam_policy_document.cluster_autoscaler[0]: Reading...
module.cluster_autoscaler_irsa_role.data.aws_iam_policy_document.cluster_autoscaler[0]: Read complete after 0s [id=4218990374]
module.cluster_autoscaler_irsa_role.aws_iam_policy.cluster_autoscaler[0]: Refreshing state... [id=arn:aws:iam::654654211926:policy/AmazonEKS_Cluster_Autoscaler_Policy-20240925131929972800000006]
module.ebs_csi_irsa_role.aws_iam_role_policy_attachment.ebs_csi[0]: Refreshing state... [id=eks-cluster-ebs-csi-2024092513312374570000001e]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.lb_irsa_role.aws_iam_role_policy_attachment.load_balancer_controller[0]: Refreshing state... [id=eks-cluster-lb-2024092513312364700000001c]
kubernetes_service_account.aws_load_balancer_controller_sa: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.external_dns_irsa_role.aws_iam_role_policy_attachment.external_dns[0]: Refreshing state... [id=eks-cluster-external-dns-2024092513312382250000001f]
module.cluster_autoscaler_irsa_role.aws_iam_role_policy_attachment.cluster_autoscaler[0]: Refreshing state... [id=cluster-autoscaler-2024092513312367230000001d]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=eks-cluster:aws-ebs-csi-driver]
null_resource.update_kubeconfig: Refreshing state... [id=8638728857926733580]
helm_release.cluster_autoscaler: Refreshing state... [id=cluster-autoscaler]
helm_release.lb: Refreshing state... [id=aws-load-balancer-controller]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "example3.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.example3.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "example3.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.example3.com",
          + "example3.com",
        ]
      + tags                      = {
          + "Name" = "example3.com"
        }
      + tags_all                  = {
          + "Name" = "example3.com"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)

      + timeouts {}
    }

  # module.acm.aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z08508331WWLDEA0ZZ7DH"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Error: Kubernetes cluster unreachable: invalid configuration: no configuration has been provided, try setting KUBERNETES_MASTER environment variable
│ 
│   with helm_release.cluster_autoscaler,
│   on helm.tf line 1, in resource "helm_release" "cluster_autoscaler":
│    1: resource "helm_release" "cluster_autoscaler" {
│ 
╵
╷
│ Error: Kubernetes cluster unreachable: invalid configuration: no configuration has been provided, try setting KUBERNETES_MASTER environment variable
│ 
│   with helm_release.lb,
│   on helm.tf line 45, in resource "helm_release" "lb":
│   45: resource "helm_release" "lb" {
│ 
╵


```
</details>